//##############################################################################
// $Copyright:
// Copyright (C) 2017-2024 Texas Instruments Incorporated - http://www.ti.com/
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY

// 6 motor models. If add more motor models, need to add the parameters in
//                    aMotorPrms[] in blower_system.c file
typedef enum
{
    M1_Teknic_M2310PL    = 0,       // Teknic_M2310PLN04K
    M2_Estun_04APB22     = 1,       // Estun_EMJ_04APB22
    M3_LACFAN_ZKSN_750   = 2,       // LACFAN_ZKSN_750
    M4_Marathon_N56PNRA  = 3,       // Marathon_N56PNRA10102
    M5_VFWM_DDLG8p4kg    = 4,       // VFWMPM_DDLG8p4kg
    M6_VFWM_WLBW550Q20   = 5,       //
    M7_GMCC_KSK89D53U    = 6,       //
    M8_IDTEST_MOTOR01    = 7,       //
    M9_IDTEST_MOTOR02    = 8,       //
    M10_IDTEST_MOTOR03   = 9,       //
    M11_IDTEST_MOTOR04   = 10,      //
    M12_IDTEST_MOTOR05   = 11,      //
    MOTOR_MAX_NUM        = 4
}MOTOR_Model_e;


//! \brief Enumeration for the device configuration
typedef enum
{
    PRJ_NON_SYSCONFIG  = 0,         //!< Without using Sysconfig
    PRJ_DEV_SYSCONFIG  = 1,         //!< Multiple Sysconfig files only for device configuration
    PRJ_ALL_SYSCONFIG  = 2          //!< A single Sysconfig file for device and project configuration
} Project_Config_e;


//! \brief Enumeration for the kit boards
typedef enum
{
    BOARD_WMINVBRD_REV1P0  = 1,     //!< the board is WMINVBRD_REV1P0, OK,
    BOARD_HVMTRPFC_REV1P1  = 2,     //!< the board is HVMTRPFC_REV1P1, OK, in MCSDK
    BOARD_BSXL8323RH_REVB  = 3,     //!< the board is BOOSTXL_8323RH,  OK, in MCSDK
    BOARD_DRV8329AEVM_REVA = 4,     //!< the board is DRV8312KIT_REVD, OK
    BOARD_TIDSMPFC_REV3P2  = 5,     //!< the board is TIDSMPFC_REV3P2, OK,
    BOARD_DRV8353RH_EVM    = 6      //!< the board is DRV8353RH_EVM, OK
} Board_Kit_e;


//! \brief Enumeration for the applications
typedef enum
{
    APP_SMDC_WASHER    = 0,         //!<
    APP_SMDC_DRYER     = 1,         //!<
    APP_SMPFC_VFAC     = 2,         //!<
    APP_SMDC_HEATPUMP  = 3,         //!<
    APP_SMDC_INDFAN    = 4,         //!<
    APP_SMDC_ACFAN     = 5          //!<
} Application_Type_e;

//! \brief Enumeration for the estimator mode
//  0 -ESTIMATOR_MODE_FAST
//  1 -ESTIMATOR_MODE_ESMO
#if defined(MOTOR1_FAST) && defined(MOTOR1_ESMO)
typedef enum
{
    ESTIMATOR_MODE_FAST  = 0,             //!< FAST estimator
    ESTIMATOR_MODE_ESMO  = 1              //!< ESMO estimator
} ESTIMATOR_Mode_e;
#elif defined(MOTOR1_FAST)
typedef enum
{
    ESTIMATOR_MODE_FAST  = 0              //!< FAST estimator
} ESTIMATOR_Mode_e;
#elif defined(MOTOR1_ESMO)
typedef enum
{
    ESTIMATOR_MODE_ESMO  = 1              //!< ESMO estimator
} ESTIMATOR_Mode_e;
#else
#error Not select a right estimator for this project
#endif  // MOTOR1_FAST | MOTOR1_ESMO

typedef enum
{
    FAST_TYPE_SOFTLIB_FLASH  = 0,   //!< the FAST software library and run in Flash
    FAST_TYPE_ROMLIB_FLASH   = 1,   //!< the FAST ROM library and run in Flash
    FAST_TYPE_ROMLIB_RAM     = 2,   //!< the FAST ROM library and run in RAM
    FAST_TYPE_NONFAST_FLASH  = 3,   //!< the non FAST and run in Flash
    FAST_TYPE_NONFAST_RAM    = 4    //!< the non FAST and run in RAM
} FASTLIB_Type_e;

#if defined(CMD_POT_EN)
typedef struct _CMDPOT_Vars_t_
{
    float32_t speedSet_Hz;
    float32_t speedMin_Hz;
    float32_t speedMax_Hz;
    float32_t speedConv_sf;
    uint16_t adcMin;
    uint16_t waitTimeCnt;
    uint16_t waitTimeSet;
    bool    flagCmdRun;
    bool    flagEnableCmd;
} CMDPOT_Vars_t;
#endif  // CMD_POT_EN

#if defined(CMD_CAP_EN)
typedef struct _CMDCAP_Vars_t_
{
    float32_t speedRef_Hz;
    float32_t freqScaler;       // Scaler converting 1/N CPU cycles
    float32_t speedMeas_Hz;
    float32_t speedSet_Hz;
    float32_t speedMin_Hz;
    float32_t speedMax_Hz;
    uint32_t  timeStamp;
    uint16_t  waitTimeCnt;
    uint16_t  waitTimeSet;
    bool      flagCmdRun;
    bool      flagEnableCmd;
} CMDCAP_Vars_t;
#endif // CMD_CAP_EN

#if defined(CMD_SWITCH_EN)
typedef struct _CMDSWITCH_Vars_t_
{
    uint16_t delayTimeSet;
    uint16_t highTimeCnt;
    uint16_t lowTimeCnt;
    bool     flagCmdRun;
    bool     flagEnablCmd;
} CMDSWITCH_Vars_t;
#endif  // CMD_SWITCH_EN


//! \brief typedefs for the control types
typedef struct _CONTROL_TYPES_BITS_
{             // bits  description
    Estimator_Type_e        estimatorType:2;    // 0~1
    CurrentShunt_Type_e     currentSenType:2;   // 2~3
    SVM_Mode_e              svmMode:2;          // 4~5
    Braking_Mode_e          brakingMode:2;      // 6~7
    Operation_Mode_e        operationMode:3;    // 8~10
    ESTIMATOR_Mode_e        estimatorMode:1;    // 11
    FlyingStart_Mode_e      flyingStartMode:1;  // 12
    RsOnline_Mode_e         RsOnlineMode:1;     // 13
    CurrentSense_Dir_e      currentSenDir:1;    // 14
    Startup_Mode_e          startupMode:1;      // 15
} CONTROL_TYPES_BITS;

typedef union _CONTROL_TYPES_t_
{
    uint16_t            all;
    CONTROL_TYPES_BITS  bit;
}CONTROL_TYPES_t;


//! \brief typedefs for the control functions
typedef struct _CONTROL_FUNCS_BITS_
{             // bits  description
    uint16_t enableRsRecalculate:1;         // 0
    uint16_t enableRsOnline:1;              // 1
    uint16_t enableMTPA:1;                  // 2
    uint16_t enableFieldWeakening:1;        // 3
    uint16_t enableDecoupleCtrl:1;          // 4
    uint16_t enablePirsControl:1;           // 5
    uint16_t enableVibComp:1;               // 6
    uint16_t enableForceAngle:1;            // 7
    uint16_t enableBrakingStop:1;           // 8
    uint16_t enableFlyingStart:1;           // 9
    uint16_t enableSSIPD:1;                 // 10
    uint16_t enableIPDHFI:1;                // 11
    uint16_t enableLsUpdate:1;              // 12
    uint16_t enablePrmsUpdateSave:1;        // 13
    uint16_t enableOverModulation:1;        // 14
    uint16_t enableReserved:1;              // 15
} CONTROL_FUNCS_BITS;


typedef union _CONTROL_FUNCS_t_
{
    uint16_t            all;
    CONTROL_FUNCS_BITS  bit;
}CONTROL_FUNCS_t;


//! \brief typedefs for the fault
typedef struct _FAULT_MTR_BITS_
{             // bits  description
    uint16_t overVoltage:1;         // 0  DC Bus Over Voltage Fault
    uint16_t underVoltage:1;        // 1  DC Bus Under Voltage Fault
    uint16_t motorOverTemp:1;       // 2  Motor over temperature Fault
    uint16_t moduleOverTemp:1;      // 3  Power module over temperature Fault

    uint16_t moduleOverCurrent:1;   // 4  Hardware Over Current Fault Flag
    uint16_t overPeakCurrent:1;     // 5  internal CMPSS Over Current Fault Flag
    uint16_t overLoad:1;            // 6  Over Load Error
    uint16_t motorLostPhase:1;      // 7  Motor Lost Phase

    uint16_t currentUnbalance:1;    // 8  Motor Phase Current imbalance
    uint16_t motorStall:1;          // 9  Motor Stall
